src/intepreter/logic_evalutor.org
#+TITLE: 逻辑求值器
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/main.css" />
#+OPTIONS: num:nil timestamp:nil 

*数学* 处理 _说明式_ 知识， *计算机* 科学处理 _命令式_ 知识：
+ 程序语言要求用 _算法的方式_ 描述解决问题过程
+ 实际上程序语言也常提供一些 _说明性描述_ 方式：
  + 用户可以省去计算过程的很多细节描述，例如输出函数的格式描述

#+BEGIN_EXAMPLE
  多数程序语言要求用定义数学函数的方式组织程序：

  程序描述的是“怎么做”
  所描述的计算有明确方向，从输入到输出
  描述函数关系的表达式，也给出了计算出结果的方法
  定义的过程完成从参数到结果的计算
#+END_EXAMPLE

同样也有些例外。比如：
+ _约束传递_ 系统中的计算对象是约束关系，没有明确的计算方向和顺序，其基础系统要做很多工作来支持计算
+ _非确定性_ 程序求值器里的表达式可有多个值，求值器设法根据表达式描述的关系找出满足要求的

* 逻辑式程序设计
  *逻辑程序设计* 可看作上面想法的一种推广，它基于 _关系模型_ 和称为 _合一_ 的重要操作，其编程就是用 *逻辑公式描述事物之间的约束关系* （属于“是什么”的范畴），支持 *多重结果和无确定方向* 的计算

  #+BEGIN_EXAMPLE
    逻辑程序设计特别适合一些应用领域的需要

    如数据库查询语言 Datalog ，支持查询基于已有事实的隐含事实
  #+END_EXAMPLE

  一个“是什么”的描述可能蕴涵许多“怎样做”的过程，比如：

  #+BEGIN_SRC scheme
  (define (append x y)
    (if (null? x)
	y
	(cons (car x) (append (cdr x) y))))
  #+END_SRC

  可以认为，这个程序表达的是两条规则：
  1. 对任何一个表 y，空表与其拼接得到的表就是 y 本身
  2. 对任何表 u, v, y, z： _(cons u v)_  与 _y_ 拼接得到 _(cons u z)_ 的条件是 *v 与 y  的 _append_  是 z* 



  - append _过程_ 定义和两条 _规则_ 都可以回答下面问题：
    + 找出 (a b) 和 (c d) 的 append
  - 然而这两条 *规则* 还可以回答下面问题（但 append  _过程_ 不行）：
    + 找出一个表 y 使 (a b) 与它的拼接能得到 (a b c d)
    + 找出所有拼接起来能得到 (a b c d) 的表 x 和 y

  在逻辑式程序语言里，可以写出与上面两条规则直接对应的表达式，求值器可以基于它得到上述几个问题的解

  #+BEGIN_EXAMPLE
    各种逻辑语言（包括下面介绍的）都有缺陷，简单提供“做什么”知识

    有时会使求值器陷入无穷循环或产生非用户希望的行为
  #+END_EXAMPLE

** 演绎信息检索
   逻辑式编程语言特别适合用作 _数据库接口_ ，完成 *复杂的信息检索* 。 _查询语言_ 就是为此设计的，先用一个实例展示逻辑式编程的使用：

