html/intepreter/logic_evalutor.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>逻辑求值器</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="content">
<h1 class="title">逻辑求值器</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org612035b">逻辑式程序设计</a>
<ul>
<li><a href="#org830a03e">演绎信息检索</a>
<ul>
<li><a href="#orgb3413b5">简单数据库</a></li>
<li><a href="#org4aeffba">简单查询</a>
<ul>
<li><a href="#org11b98ee">总结</a></li>
</ul>
</li>
<li><a href="#org2028587">复合查询</a>
<ul>
<li><a href="#org2c6289d">and 查询</a></li>
<li><a href="#org925c879">or 查询</a></li>
<li><a href="#org8fe2639">not 查询</a></li>
<li><a href="#orge2d4b18">lisp-value</a></li>
</ul>
</li>
<li><a href="#org3723c4c">规则</a></li>
<li><a href="#org15196b6">逻辑程序</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga080a14">实现</a></li>
</ul>
</div>
</div>
<p>
<b>数学</b> 处理 <span class="underline">说明式</span> 知识， <b>计算机</b> 科学处理 <span class="underline">命令式</span> 知识：
</p>
<ul class="org-ul">
<li>程序语言要求用 <span class="underline">算法的方式</span> 描述解决问题过程</li>
<li>实际上程序语言也常提供一些 <span class="underline">说明性描述</span> 方式：
<ul class="org-ul">
<li>用户可以省去计算过程的很多细节描述，例如输出函数的格式描述</li>
</ul></li>
</ul>

<pre class="example">
  多数程序语言要求用定义数学函数的方式组织程序：

  程序描述的是“怎么做”
  所描述的计算有明确方向，从输入到输出
  描述函数关系的表达式，也给出了计算出结果的方法
  定义的过程完成从参数到结果的计算
</pre>

<p>
同样也有些例外。比如：
</p>
<ul class="org-ul">
<li><span class="underline">约束传递</span> 系统中的计算对象是约束关系，没有明确的计算方向和顺序，其基础系统要做很多工作来支持计算</li>
<li><span class="underline">非确定性</span> 程序求值器里的表达式可有多个值，求值器设法根据表达式描述的关系找出满足要求的</li>
</ul>

<div id="outline-container-org612035b" class="outline-2">
<h2 id="org612035b">逻辑式程序设计</h2>
<div class="outline-text-2" id="text-org612035b">
<p>
<b>逻辑程序设计</b> 可看作上面想法的一种推广，它基于 <span class="underline">关系模型</span> 和称为 <span class="underline">合一</span> 的重要操作，其编程就是用 <b>逻辑公式描述事物之间的约束关系</b> （属于“是什么”的范畴），支持 <b>多重结果和无确定方向</b> 的计算
</p>

<pre class="example">
    逻辑程序设计特别适合一些应用领域的需要

    如数据库查询语言 Datalog ，支持查询基于已有事实的隐含事实
</pre>

<p>
一个“是什么”的描述可能蕴涵许多“怎样做”的过程，比如：
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">append</span> x y<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>null? x<span style="color: #696969;">)</span>
      y
      <span style="color: #696969;">(</span>cons <span style="color: #696969;">(</span>car x<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>append <span style="color: #696969;">(</span>cdr x<span style="color: #696969;">)</span> y<span style="color: #696969;">))))</span>
</pre>
</div>

<p>
可以认为，这个程序表达的是两条规则：
</p>
<ol class="org-ol">
<li>对任何一个表 y，空表与其拼接得到的表就是 y 本身</li>
<li>对任何表 u, v, y, z： <span class="underline">(cons u v)</span>  与 <span class="underline">y</span> 拼接得到 <span class="underline">(cons u z)</span> 的条件是 <b>v 与 y  的 <span class="underline">append</span>  是 z</b></li>
</ol>



<ul class="org-ul">
<li>append <span class="underline">过程</span> 定义和两条 <span class="underline">规则</span> 都可以回答下面问题：
<ul class="org-ul">
<li>找出 (a b) 和 (c d) 的 append</li>
</ul></li>
<li>然而这两条 <b>规则</b> 还可以回答下面问题（但 append  <span class="underline">过程</span> 不行）：
<ul class="org-ul">
<li>找出一个表 y 使 (a b) 与它的拼接能得到 (a b c d)</li>
<li>找出所有拼接起来能得到 (a b c d) 的表 x 和 y</li>
</ul></li>
</ul>

<p>
在逻辑式程序语言里，可以写出与上面两条规则直接对应的表达式，求值器可以基于它得到上述几个问题的解
</p>

<pre class="example">
    各种逻辑语言（包括下面介绍的）都有缺陷，简单提供“做什么”知识

    有时会使求值器陷入无穷循环或产生非用户希望的行为
</pre>
</div>

<div id="outline-container-org830a03e" class="outline-3">
<h3 id="org830a03e">演绎信息检索</h3>
<div class="outline-text-3" id="text-org830a03e">
<p>
逻辑式编程语言特别适合用作 <span class="underline">数据库接口</span> ，完成 <b>复杂的信息检索</b> 。 <span class="underline">查询语言</span> 就是为此设计的，先用一个实例展示逻辑式编程的使用：
</p>
</div>
