src/intepreter/logic_evalutor.org
*** 简单数据库
    设 Microshaft 公司（位于波士顿的高科技公司）需要人事数据库，逻辑式语言不仅能做数据导向的信息访问，还能基于已有数据做推理

    数据库内容是有关公司人事的断言，有许多描述各种事实的断言。Ben 是公司的计算机专家，关于他的断言如下：

    #+BEGIN_SRC scheme
  (address (Bitdiddle Ben) (Slumerville (Ridge Road) 10))

  (job (Bitdiddle Ben) (computer wizard))

  (salary (Bitdiddle Ben) 60000)
    #+END_SRC

    + 在形式上，每个断言是一个表，其元素还可以是表
    + 一个断言描述一个客观事实

    Ben 管理公司的计算机分部，管理两个程序员和一个计算机技师：

    #+BEGIN_SRC scheme
  (address (Hacker Alyssa P) (Cambridge (Mass Ave) 78))
  (job (Hacker Alyssa P) (computer programmer))
  (salary (Hacker Alyssa P) 40000)
  (supervisor (Hacker Alyssa P) (Bitdiddle Ben))

  (address (Fect Cy D) (Cambridge (Ames Street) 3))
  (job (Fect Cy D) (computer programmer))
  (salary (Fect Cy D) 35000)
  (supervisor (Fect Cy D) (Bitdiddle Ben))

  (address (Tweakit Lem E) (Boston (Bay State Road) 22))
  (job (Tweakit Lem E) (computer technician))
  (salary (Tweakit Lem E) 25000)
  (supervisor (Tweakit Lem E) (Bitdiddle Ben))
    #+END_SRC

    Hacker Alyssa 管着一个实习程序员：
    #+BEGIN_SRC scheme
  (address (Reasoner Louis) (Slumerville (Pine Tree Road) 80))
  (job (Reasoner Louis) (computer programmer trainee))
  (salary (Reasoner Louis) 30000)
  (supervisor (Reasoner Louis) (Hacker Alyssa P))
    #+END_SRC

    #+BEGIN_EXAMPLE
      计算机分部所有人员的职务的第一个符号都是 computer
    #+END_EXAMPLE

    Ben 是公司的高级雇员，其上司是公司大老板 Oliver：
    #+BEGIN_SRC scheme
  (supervisor (Bitdiddle Ben) (Warbucks Oliver))
  (address (Warbucks Oliver) (Swellesley (Top Heap Road)))
  (job (Warbucks Oliver) (administration big wheel))
  (salary (Warbucks Oliver) 150000)
    #+END_SRC

    公司有一个财务分部，人员包括一个主管会计和一个助手：
    #+BEGIN_SRC scheme
  (address (Scrooge Eben) (Weston (Shady Lane) 10))
  (job (Scrooge Eben) (accounting chief accountant))
  (salary (Scrooge Eben) 75000)
  (supervisor (Scrooge Eben) (Warbucks Oliver))

  (address (Cratchet Robert) (Allston (N Harvard Street) 16))
  (job (Cratchet Robert) (accounting scrivener))
  (salary (Cratchet Robert) 18000)
  (supervisor (Cratchet Robert) (Scrooge Eben))
    #+END_SRC

    老板有一个秘书：
    #+BEGIN_SRC scheme
  (address (Aull DeWitt) (Slumerville (Onion Square) 5))
  (job (Aull DeWitt) (administration secretary))
  (salary (Aull DeWitt) 25000)
  (supervisor (Aull DeWitt) (Warbucks Oliver))
    #+END_SRC

    还有一些断言说明各种人能从事的工作之间的关系：
    + 计算机专家可以做程序员和技师的工作：
    #+BEGIN_SRC scheme
  (can-do-job (computer wizard) (computer programmer))
  (can-do-job (computer wizard) (computer technician))
    #+END_SRC
    + 程序员可以做实习程序员的工作：
    #+BEGIN_SRC scheme
  (can-do-job (computer programmer)
	      (computer programmer trainee))
    #+END_SRC
    + 秘书可以做老板的工作：
    #+BEGIN_SRC scheme
  (can-do-job (administration secretary)
	      (administration big wheel))
    #+END_SRC

