html/intepreter/logic_evalutor.html

<div id="outline-container-orgb3413b5" class="outline-4">
<h4 id="orgb3413b5">简单数据库</h4>
<div class="outline-text-4" id="text-orgb3413b5">
<p>
设 Microshaft 公司（位于波士顿的高科技公司）需要人事数据库，逻辑式语言不仅能做数据导向的信息访问，还能基于已有数据做推理
</p>

<p>
数据库内容是有关公司人事的断言，有许多描述各种事实的断言。Ben 是公司的计算机专家，关于他的断言如下：
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>address <span style="color: #696969;">(</span>Bitdiddle Ben<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>Slumerville <span style="color: #696969;">(</span>Ridge Road<span style="color: #696969;">)</span> 10<span style="color: #696969;">))</span>

<span style="color: #696969;">(</span>job <span style="color: #696969;">(</span>Bitdiddle Ben<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>computer wizard<span style="color: #696969;">))</span>

<span style="color: #696969;">(</span>salary <span style="color: #696969;">(</span>Bitdiddle Ben<span style="color: #696969;">)</span> 60000<span style="color: #696969;">)</span>
</pre>
</div>

<ul class="org-ul">
<li>在形式上，每个断言是一个表，其元素还可以是表</li>
<li>一个断言描述一个客观事实</li>
</ul>

<p>
Ben 管理公司的计算机分部，管理两个程序员和一个计算机技师：
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>address <span style="color: #696969;">(</span>Hacker Alyssa P<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>Cambridge <span style="color: #696969;">(</span>Mass Ave<span style="color: #696969;">)</span> 78<span style="color: #696969;">))</span>
<span style="color: #696969;">(</span>job <span style="color: #696969;">(</span>Hacker Alyssa P<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>computer programmer<span style="color: #696969;">))</span>
<span style="color: #696969;">(</span>salary <span style="color: #696969;">(</span>Hacker Alyssa P<span style="color: #696969;">)</span> 40000<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span>supervisor <span style="color: #696969;">(</span>Hacker Alyssa P<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>Bitdiddle Ben<span style="color: #696969;">))</span>

<span style="color: #696969;">(</span>address <span style="color: #696969;">(</span>Fect Cy D<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>Cambridge <span style="color: #696969;">(</span>Ames Street<span style="color: #696969;">)</span> 3<span style="color: #696969;">))</span>
<span style="color: #696969;">(</span>job <span style="color: #696969;">(</span>Fect Cy D<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>computer programmer<span style="color: #696969;">))</span>
<span style="color: #696969;">(</span>salary <span style="color: #696969;">(</span>Fect Cy D<span style="color: #696969;">)</span> 35000<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span>supervisor <span style="color: #696969;">(</span>Fect Cy D<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>Bitdiddle Ben<span style="color: #696969;">))</span>

<span style="color: #696969;">(</span>address <span style="color: #696969;">(</span>Tweakit Lem E<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>Boston <span style="color: #696969;">(</span>Bay State Road<span style="color: #696969;">)</span> 22<span style="color: #696969;">))</span>
<span style="color: #696969;">(</span>job <span style="color: #696969;">(</span>Tweakit Lem E<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>computer technician<span style="color: #696969;">))</span>
<span style="color: #696969;">(</span>salary <span style="color: #696969;">(</span>Tweakit Lem E<span style="color: #696969;">)</span> 25000<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span>supervisor <span style="color: #696969;">(</span>Tweakit Lem E<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>Bitdiddle Ben<span style="color: #696969;">))</span>
</pre>
</div>

<p>
Hacker Alyssa 管着一个实习程序员：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>address <span style="color: #696969;">(</span>Reasoner Louis<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>Slumerville <span style="color: #696969;">(</span>Pine Tree Road<span style="color: #696969;">)</span> 80<span style="color: #696969;">))</span>
<span style="color: #696969;">(</span>job <span style="color: #696969;">(</span>Reasoner Louis<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>computer programmer trainee<span style="color: #696969;">))</span>
<span style="color: #696969;">(</span>salary <span style="color: #696969;">(</span>Reasoner Louis<span style="color: #696969;">)</span> 30000<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span>supervisor <span style="color: #696969;">(</span>Reasoner Louis<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>Hacker Alyssa P<span style="color: #696969;">))</span>
</pre>
</div>

<pre class="example">
      计算机分部所有人员的职务的第一个符号都是 computer
</pre>

<p>
Ben 是公司的高级雇员，其上司是公司大老板 Oliver：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>supervisor <span style="color: #696969;">(</span>Bitdiddle Ben<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>Warbucks Oliver<span style="color: #696969;">))</span>
<span style="color: #696969;">(</span>address <span style="color: #696969;">(</span>Warbucks Oliver<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>Swellesley <span style="color: #696969;">(</span>Top Heap Road<span style="color: #696969;">)))</span>
<span style="color: #696969;">(</span>job <span style="color: #696969;">(</span>Warbucks Oliver<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>administration big wheel<span style="color: #696969;">))</span>
<span style="color: #696969;">(</span>salary <span style="color: #696969;">(</span>Warbucks Oliver<span style="color: #696969;">)</span> 150000<span style="color: #696969;">)</span>
</pre>
</div>

<p>
公司有一个财务分部，人员包括一个主管会计和一个助手：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>address <span style="color: #696969;">(</span>Scrooge Eben<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>Weston <span style="color: #696969;">(</span>Shady Lane<span style="color: #696969;">)</span> 10<span style="color: #696969;">))</span>
<span style="color: #696969;">(</span>job <span style="color: #696969;">(</span>Scrooge Eben<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>accounting chief accountant<span style="color: #696969;">))</span>
<span style="color: #696969;">(</span>salary <span style="color: #696969;">(</span>Scrooge Eben<span style="color: #696969;">)</span> 75000<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span>supervisor <span style="color: #696969;">(</span>Scrooge Eben<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>Warbucks Oliver<span style="color: #696969;">))</span>

<span style="color: #696969;">(</span>address <span style="color: #696969;">(</span>Cratchet Robert<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>Allston <span style="color: #696969;">(</span>N Harvard Street<span style="color: #696969;">)</span> 16<span style="color: #696969;">))</span>
<span style="color: #696969;">(</span>job <span style="color: #696969;">(</span>Cratchet Robert<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>accounting scrivener<span style="color: #696969;">))</span>
<span style="color: #696969;">(</span>salary <span style="color: #696969;">(</span>Cratchet Robert<span style="color: #696969;">)</span> 18000<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span>supervisor <span style="color: #696969;">(</span>Cratchet Robert<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>Scrooge Eben<span style="color: #696969;">))</span>
</pre>
</div>

<p>
老板有一个秘书：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>address <span style="color: #696969;">(</span>Aull DeWitt<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>Slumerville <span style="color: #696969;">(</span>Onion Square<span style="color: #696969;">)</span> 5<span style="color: #696969;">))</span>
<span style="color: #696969;">(</span>job <span style="color: #696969;">(</span>Aull DeWitt<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>administration secretary<span style="color: #696969;">))</span>
<span style="color: #696969;">(</span>salary <span style="color: #696969;">(</span>Aull DeWitt<span style="color: #696969;">)</span> 25000<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span>supervisor <span style="color: #696969;">(</span>Aull DeWitt<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>Warbucks Oliver<span style="color: #696969;">))</span>
</pre>
</div>

<p>
还有一些断言说明各种人能从事的工作之间的关系：
</p>
<ul class="org-ul">
<li>计算机专家可以做程序员和技师的工作：</li>
</ul>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>can-do-job <span style="color: #696969;">(</span>computer wizard<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>computer programmer<span style="color: #696969;">))</span>
<span style="color: #696969;">(</span>can-do-job <span style="color: #696969;">(</span>computer wizard<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>computer technician<span style="color: #696969;">))</span>
</pre>
</div>
<ul class="org-ul">
<li>程序员可以做实习程序员的工作：</li>
</ul>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>can-do-job <span style="color: #696969;">(</span>computer programmer<span style="color: #696969;">)</span>
            <span style="color: #696969;">(</span>computer programmer trainee<span style="color: #696969;">))</span>
</pre>
</div>
<ul class="org-ul">
<li>秘书可以做老板的工作：</li>
</ul>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>can-do-job <span style="color: #696969;">(</span>administration secretary<span style="color: #696969;">)</span>
            <span style="color: #696969;">(</span>administration big wheel<span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>
