src/intepreter/logic_evalutor.org
*** 简单查询
    要查询数据库里的信息，只需在提示符下输入查询。如：
    #+BEGIN_EXAMPLE
      ;;; Query input:
      (job ?x (computer programmer))

      ;;; Query results:
      (job (Hacker Alyssa P) (computer programmer))
      (job (Fect Cy D) (computer programmer))
    #+END_EXAMPLE

    + 查询语句描述要 *查询信息的模式* ，其中有些项是 _具体信息_ ： 
      + _问号开头的模式变量_ 项（上面 ?x ）可与任何东西匹配
    + 系统响应查询时，给出 *数据库里与查询模式 _匹配的所有_ 条目* 

    + 需要区分 _多个匹配_ 和 _同一匹配的多次_ 出现，因此 *模式变量需要名字* ： 
    #+BEGIN_EXAMPLE
      (address ?x ?y) : 系统列出所有雇员的地址条目
    #+END_EXAMPLE

    + 如果查询中没有变量，就相当于问相应事实是否存在
    + 同一模式变量可在一个查询里出现多次，表示需要 _同一匹配_ ：
    #+BEGIN_EXAMPLE
      (supervisor ?x ?x) ：要求给出所有自己管自己的雇员的条目
    #+END_EXAMPLE

    列出所有从事计算机工作的雇员：
    #+BEGIN_SRC scheme
  (job ?x (computer ?type))
    #+END_SRC

    系统响应是：
    #+BEGIN_EXAMPLE
      (job (Bitdiddle Ben) (computer wizard))
      (job (Hacker Alyssa P) (computer programmer))
      (job (Fect Cy D) (computer programmer))
      (job (Tweakit Lem E) (computer technician))
    #+END_EXAMPLE

    由于 _?type_ 只能匹配一个项，他不匹配：
    #+BEGIN_EXAMPLE
      (job (Reasoner Louis) (computer programmer trainee))
    #+END_EXAMPLE

    如果希望匹配第一个元素是 _computer_  的 *所有条目* ，应写：
    #+BEGIN_SRC scheme
  (job ?x (computer . ?type))
    #+END_SRC

    *(computer . ?type)* 能匹配 _(computer programmer trainee)_ ，也能匹配 _(computer technician)_ 和 _(computer)_  

**** 总结
     + 设法找出使查询语句中的模式变量满足查询模式的所有赋值，即找出这些变量的所有可能指派（具体表达式），使得把模式中的变量代换为具体表达式后得到的条目在数据库里
     + 对查询的响应是列出数据库里所有满足模式的条目，用找到的所有可能赋值对查询模式实例化，显示得到的结果
     + 如果查询模式里无变量，就简化为对该查询是否出现在数据库里的检验。相应的赋值是空赋值

*** 复合查询
    简单查询是基本操作，可以在其基础上构造 *复合查询* 。查询语言的组合手段是连接词 _and_ ,  _or_ 和 _not_ 
    #+BEGIN_EXAMPLE
    注意：这些组合手段不是 Scheme 内部操作
    #+END_EXAMPLE
    对复合查询，系统也是 *设法找出所有能满足它的赋值* ，并显示用这些赋值实例化查询模式得到的结果

**** and 查询
     and 复合的一般形式：

     #+BEGIN_EXAMPLE
       (and <query1><query2> ... <queryn>)
     #+END_EXAMPLE

     要求找到的变量赋值满足 _(and <query1><query2> ... <queryn>)_ 中的 *每个* 查询。比如找出所有程序员的住址：
     #+BEGIN_SRC scheme
  (and (job ?person (computer programmer))
       (address ?person ?where))
     #+END_SRC

     返回的响应是：
     #+BEGIN_EXAMPLE
       (and (job (Hacker Alyssa P) (computer programmer))
	    (address (Hacker Alyssa P) (Cambridge (Mass Ave) 78)))
       (and (job (Fect Cy D) (computer programmer))
	    (address (Fect Cy D) (Cambridge (Ames Street) 3)))
     #+END_EXAMPLE

**** or 查询
     or 复合的一般形式：
     #+BEGIN_EXAMPLE
       (or <query1><query2> ... <queryn>)
     #+END_EXAMPLE

     要求找出所有能满足 _(or <query1><query2> ... <queryn>)_  *之一* 的赋值，给出用这些赋值实例化的结果。比如：得到由Ben Bitdiddle 或 Alyssa P. Hacker 管理的雇员名单：

     #+BEGIN_SRC scheme
  (or (supervisor ?x (Bitdiddle Ben))
      (supervisor ?x (Hacker Alyssa P)))
     #+END_SRC

     查询结果：
     #+BEGIN_EXAMPLE
       (or (supervisor (Hacker Alyssa P) (Bitdiddle Ben))
	   (supervisor (Hacker Alyssa P) (Hacker Alyssa P)))
       (or (supervisor (Fect Cy D) (Bitdiddle Ben))
	   (supervisor (Fect Cy D) (Hacker Alyssa P)))
       (or (supervisor (Tweakit Lem E) (Bitdiddle Ben))
	   (supervisor (Tweakit Lem E) (Hacker Alyssa P)))
       (or (supervisor (Reasoner Louis) (Bitdiddle Ben))
	   (supervisor (Reasoner Louis) (Hacker Alyssa P)))
     #+END_EXAMPLE

**** not 查询
     not 查询的一般形式为：
     #+BEGIN_EXAMPLE
       (not <query>)
     #+END_EXAMPLE

     要求得到所有使 _<query>_   *不成立* 的赋值。比如，要求找出 Ben 管的所有人中的非程序员：

     #+BEGIN_SRC scheme
  (and (supervisor ?x (Bitdiddle Ben))
       (not (job ?x (computer programmer))))
     #+END_SRC

**** lisp-value
     _lisp-value_ 的一般形式：
     #+BEGIN_EXAMPLE
       (lisp-value <predicate><arg1> ... <argn>)
     #+END_EXAMPLE

     第一参数 _<predicate>_ 是一个Lisp 谓词。要求将 *谓词作用于后面的参数* （ _赋值后得到的值_ ）， 选出使 *谓词为真* 的所有赋值。比如：选出所有工资高于 30000 的人

     #+BEGIN_SRC scheme
  (and (salary ?person ?amount)
       (lisp-value > ?amount 30000))
     #+END_SRC

     利用 _lisp-value_  可以很灵活地描述各种查询

