html/intepreter/logic_evalutor.html

<div id="outline-container-org4aeffba" class="outline-4">
<h4 id="org4aeffba">简单查询</h4>
<div class="outline-text-4" id="text-org4aeffba">
<p>
要查询数据库里的信息，只需在提示符下输入查询。如：
</p>
<pre class="example">
;;; Query input:
(job ?x (computer programmer))

;;; Query results:
(job (Hacker Alyssa P) (computer programmer))
(job (Fect Cy D) (computer programmer))
</pre>

<ul class="org-ul">
<li>查询语句描述要 <b>查询信息的模式</b> ，其中有些项是 <span class="underline">具体信息</span> ： 
<ul class="org-ul">
<li><span class="underline">问号开头的模式变量</span> 项（上面 ?x ）可与任何东西匹配</li>
</ul></li>
<li>系统响应查询时，给出 <b>数据库里与查询模式 <span class="underline">匹配的所有</span> 条目</b></li>

<li>需要区分 <span class="underline">多个匹配</span> 和 <span class="underline">同一匹配的多次</span> 出现，因此 <b>模式变量需要名字</b> ：</li>
</ul>
<pre class="example">
(address ?x ?y) : 系统列出所有雇员的地址条目
</pre>

<ul class="org-ul">
<li>如果查询中没有变量，就相当于问相应事实是否存在</li>
<li>同一模式变量可在一个查询里出现多次，表示需要 <span class="underline">同一匹配</span> ：</li>
</ul>
<pre class="example">
(supervisor ?x ?x) ：要求给出所有自己管自己的雇员的条目
</pre>

<p>
列出所有从事计算机工作的雇员：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>job ?x <span style="color: #696969;">(</span>computer ?type<span style="color: #696969;">))</span>
</pre>
</div>

<p>
系统响应是：
</p>
<pre class="example">
(job (Bitdiddle Ben) (computer wizard))
(job (Hacker Alyssa P) (computer programmer))
(job (Fect Cy D) (computer programmer))
(job (Tweakit Lem E) (computer technician))
</pre>

<p>
由于 <span class="underline">?type</span> 只能匹配一个项，他不匹配：
</p>
<pre class="example">
(job (Reasoner Louis) (computer programmer trainee))
</pre>

<p>
如果希望匹配第一个元素是 <span class="underline">computer</span>  的 <b>所有条目</b> ，应写：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>job ?x <span style="color: #696969;">(</span>computer . ?type<span style="color: #696969;">))</span>
</pre>
</div>

<p>
<b>(computer . ?type)</b> 能匹配 <span class="underline">(computer programmer trainee)</span> ，也能匹配 <span class="underline">(computer technician)</span> 和 <span class="underline">(computer)</span>  
</p>
</div>

<div id="outline-container-org11b98ee" class="outline-5">
<h5 id="org11b98ee">总结</h5>
<div class="outline-text-5" id="text-org11b98ee">
<ul class="org-ul">
<li>设法找出使查询语句中的模式变量满足查询模式的所有赋值，即找出这些变量的所有可能指派（具体表达式），使得把模式中的变量代换为具体表达式后得到的条目在数据库里</li>
<li>对查询的响应是列出数据库里所有满足模式的条目，用找到的所有可能赋值对查询模式实例化，显示得到的结果</li>
<li>如果查询模式里无变量，就简化为对该查询是否出现在数据库里的检验。相应的赋值是空赋值</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org2028587" class="outline-4">
<h4 id="org2028587">复合查询</h4>
<div class="outline-text-4" id="text-org2028587">
<p>
简单查询是基本操作，可以在其基础上构造 <b>复合查询</b> 。查询语言的组合手段是连接词 <span class="underline">and</span> ,  <span class="underline">or</span> 和 <span class="underline">not</span> 
</p>
<pre class="example">
    注意：这些组合手段不是 Scheme 内部操作
</pre>
<p>
对复合查询，系统也是 <b>设法找出所有能满足它的赋值</b> ，并显示用这些赋值实例化查询模式得到的结果
</p>
</div>

<div id="outline-container-org2c6289d" class="outline-5">
<h5 id="org2c6289d">and 查询</h5>
<div class="outline-text-5" id="text-org2c6289d">
<p>
and 复合的一般形式：
</p>

<pre class="example">
(and &lt;query1&gt;&lt;query2&gt; ... &lt;queryn&gt;)
</pre>

<p>
要求找到的变量赋值满足 <span class="underline">(and &lt;query1&gt;&lt;query2&gt; &#x2026; &lt;queryn&gt;)</span> 中的 <b>每个</b> 查询。比如找出所有程序员的住址：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">and</span> <span style="color: #696969;">(</span>job ?person <span style="color: #696969;">(</span>computer programmer<span style="color: #696969;">))</span>
     <span style="color: #696969;">(</span>address ?person ?where<span style="color: #696969;">))</span>
</pre>
</div>

<p>
返回的响应是：
</p>
<pre class="example">
(and (job (Hacker Alyssa P) (computer programmer))
     (address (Hacker Alyssa P) (Cambridge (Mass Ave) 78)))
(and (job (Fect Cy D) (computer programmer))
     (address (Fect Cy D) (Cambridge (Ames Street) 3)))
</pre>
</div>
</div>

<div id="outline-container-org925c879" class="outline-5">
<h5 id="org925c879">or 查询</h5>
<div class="outline-text-5" id="text-org925c879">
<p>
or 复合的一般形式：
</p>
<pre class="example">
(or &lt;query1&gt;&lt;query2&gt; ... &lt;queryn&gt;)
</pre>

<p>
要求找出所有能满足 <span class="underline">(or &lt;query1&gt;&lt;query2&gt; &#x2026; &lt;queryn&gt;)</span>  <b>之一</b> 的赋值，给出用这些赋值实例化的结果。比如：得到由Ben Bitdiddle 或 Alyssa P. Hacker 管理的雇员名单：
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">or</span> <span style="color: #696969;">(</span>supervisor ?x <span style="color: #696969;">(</span>Bitdiddle Ben<span style="color: #696969;">))</span>
    <span style="color: #696969;">(</span>supervisor ?x <span style="color: #696969;">(</span>Hacker Alyssa P<span style="color: #696969;">)))</span>
</pre>
</div>

<p>
查询结果：
</p>
<pre class="example">
(or (supervisor (Hacker Alyssa P) (Bitdiddle Ben))
    (supervisor (Hacker Alyssa P) (Hacker Alyssa P)))
(or (supervisor (Fect Cy D) (Bitdiddle Ben))
    (supervisor (Fect Cy D) (Hacker Alyssa P)))
(or (supervisor (Tweakit Lem E) (Bitdiddle Ben))
    (supervisor (Tweakit Lem E) (Hacker Alyssa P)))
(or (supervisor (Reasoner Louis) (Bitdiddle Ben))
    (supervisor (Reasoner Louis) (Hacker Alyssa P)))
</pre>
</div>
</div>

<div id="outline-container-org8fe2639" class="outline-5">
<h5 id="org8fe2639">not 查询</h5>
<div class="outline-text-5" id="text-org8fe2639">
<p>
not 查询的一般形式为：
</p>
<pre class="example">
(not &lt;query&gt;)
</pre>

<p>
要求得到所有使 <span class="underline">&lt;query&gt;</span>   <b>不成立</b> 的赋值。比如，要求找出 Ben 管的所有人中的非程序员：
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">and</span> <span style="color: #696969;">(</span>supervisor ?x <span style="color: #696969;">(</span>Bitdiddle Ben<span style="color: #696969;">))</span>
     <span style="color: #696969;">(</span>not <span style="color: #696969;">(</span>job ?x <span style="color: #696969;">(</span>computer programmer<span style="color: #696969;">))))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge2d4b18" class="outline-5">
<h5 id="orge2d4b18">lisp-value</h5>
<div class="outline-text-5" id="text-orge2d4b18">
<p>
<span class="underline">lisp-value</span> 的一般形式：
</p>
<pre class="example">
(lisp-value &lt;predicate&gt;&lt;arg1&gt; ... &lt;argn&gt;)
</pre>

<p>
第一参数 <span class="underline">&lt;predicate&gt;</span> 是一个Lisp 谓词。要求将 <b>谓词作用于后面的参数</b> （ <span class="underline">赋值后得到的值</span> ）， 选出使 <b>谓词为真</b> 的所有赋值。比如：选出所有工资高于 30000 的人
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">and</span> <span style="color: #696969;">(</span>salary ?person ?amount<span style="color: #696969;">)</span>
     <span style="color: #696969;">(</span>lisp-value &gt; ?amount 30000<span style="color: #696969;">))</span>
</pre>
</div>

<p>
利用 <span class="underline">lisp-value</span>  可以很灵活地描述各种查询
</p>
</div>
</div>
</div>
